## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_glue_catalog_database.platform_gc_notify_production`     |
|        | `aws_glue_catalog_database.platform_gc_notify_production_raw` |
|        | `aws_glue_crawler.platform_gc_notify_production_raw`          |
| update | `aws_glue_trigger.platform_gc_forms_job`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_catalog_database.platform_gc_notify_production will be created
  + resource "aws_glue_catalog_database" "platform_gc_notify_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /platform/gc-notify/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_notify_production"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.platform_gc_notify_production_raw will be created
  + resource "aws_glue_catalog_database" "platform_gc_notify_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /platform/gc-notify/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_notify_production_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.platform_gc_notify_production_raw will be created
  + resource "aws_glue_crawler" "platform_gc_notify_production_raw" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 14
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "platform_gc_notify_production_raw"
      + description            = "Classify the raw GC Notify data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Notify"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "platform_gc_notify_raw_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-raw-production/platform/gc-notify"
        }
    }

  # aws_glue_trigger.platform_gc_forms_job will be updated in-place
  ~ resource "aws_glue_trigger" "platform_gc_forms_job" {
      ~ enabled       = false -> true
        id            = "Platform / GC Forms"
        name          = "Platform / GC Forms"
        tags          = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_notify_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
